; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-3-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p0-2 - location
	p1-0 - location
	p2-0 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s1)
	(at driver4 s0)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s0)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s0)
	(at package2 s2)
	(at package3 s0)
	(at package4 s2)
	(at package5 s0)
	(at package6 s2)
	(at package7 s1)
	(at package8 s2)
	(at package9 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 44)
	(= (time-to-drive s1 s0) 44)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 5)
	(= (time-to-drive s2 s1) 5)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 39)
	(= (time-to-drive s0 s2) 39)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s1)
	(at driver3 s1)
	(at truck1 s0)
	(at truck2 s2)
	(at truck3 s0)
	(at package1 s1)
	(at package2 s2)
	(at package3 s2)
	(at package4 s1)
	(at package5 s1)
	(at package6 s0)
	(at package7 s0)
	(at package8 s2)
	(at package9 s0)
	))

(:metric minimize (+ (* 1 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver4 truck2 s0)
   deleted: (at driver4 s0) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 5 of 15
2. (walk driver2 s0 p0-1)
   deleted: (at driver2 s0)
   added: (at driver2 p0-1)
   goals met: 5 of 15
3. (walk driver2 p0-1 s1)
   deleted: (at driver2 p0-1)
   added: (at driver2 s1)
   goals met: 6 of 15
4. (load-truck package1 truck2 s0)
   deleted: (at package1 s0)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 6 of 15
5. (load-truck package3 truck2 s0)
   deleted: (at package3 s0)
   added: (in package3 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 6 of 15
6. (load-truck package5 truck2 s0)
   deleted: (at package5 s0)
   added: (in package5 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 6 of 15
7. (drive-truck truck2 s0 s2 driver4)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (fuel-used) from 0 to 624
   goals met: 7 of 15
8. (unload-truck package3 truck2 s2)
   deleted: (in package3 truck2)
   added: (at package3 s2)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 8 of 15
9. (load-truck package4 truck2 s2)
   deleted: (at package4 s2)
   added: (in package4 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 8 of 15
10. (load-truck package6 truck2 s2)
   deleted: (at package6 s2)
   added: (in package6 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 8 of 15
11. (drive-truck truck2 s2 s1 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 624 to 724
   goals met: 7 of 15
12. (unload-truck package1 truck2 s1)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 8 of 15
13. (unload-truck package4 truck2 s1)
   deleted: (in package4 truck2)
   added: (at package4 s1)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 9 of 15
14. (unload-truck package5 truck2 s1)
   deleted: (in package5 truck2)
   added: (at package5 s1)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 10 of 15
15. (load-truck package7 truck2 s1)
   deleted: (at package7 s1)
   added: (in package7 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 10 of 15
16. (load-truck package9 truck2 s1)
   deleted: (at package9 s1)
   added: (in package9 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 10 of 15
17. (drive-truck truck2 s1 s0 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 724 to 1428
   goals met: 10 of 15
18. (unload-truck package6 truck2 s0)
   deleted: (in package6 truck2)
   added: (at package6 s0)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 11 of 15
19. (unload-truck package7 truck2 s0)
   deleted: (in package7 truck2)
   added: (at package7 s0)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 12 of 15
20. (unload-truck package9 truck2 s0)
   deleted: (in package9 truck2)
   added: (at package9 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 13 of 15
21. (drive-truck truck2 s0 s2 driver4)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (fuel-used) from 1428 to 1818
   goals met: 14 of 15
22. (disembark-truck driver4 truck2 s2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s2) (empty truck2)
   goals met: 14 of 15
23. (board-truck driver4 truck1 s2)
   deleted: (at driver4 s2) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 14 of 15
24. (drive-truck truck1 s2 s0 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 1818 to 2208
   goals met: 15 of 15
